waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Src/fm33fk5xx_fl_gptim.c
/**
  *******************************************************************************************************
  * @file    fm33fk5xx_fl_gptim.c
  * @author  FMSH Application Team
  * @brief   Src file of GPTIM FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2021] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under Mulan PSL v2.
  * You can use this software according to the terms and conditions of the Mulan PSL v2.
  * You may obtain a copy of Mulan PSL v2 at:
  *          http://license.coscl.org.cn/MulanPSL2
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND,
  * EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT,
  * MERCHANTABILITY OR FIT FOR A PARTICULAR PURPOSE.
  * See the Mulan PSL v2 for more details.
  *
  *******************************************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "fm33fk5xx_fl.h"

/** @addtogroup FM33FK5XX_FL_Driver
  * @{
  */

/** @addtogroup GPTIM
  * @{
  */

#ifdef FL_GPTIM_DRIVER_ENABLED

/* Private macros ------------------------------------------------------------------*/
/** @addtogroup GPTIM_FL_Private_Macros
  * @{
  */

#define IS_GPTIM_INSTANCE(TIMx)                     (((TIMx) == GPTIM0) || \
                                                     ((TIMx) == GPTIM1) || \
                                                     ((TIMx) == GPTIM2))

#define IS_FL_GPTIM_COUNTERMODE(__VALUE__)          (((__VALUE__) == FL_GPTIM_COUNTER_DIR_UP) || \
                                                     ((__VALUE__) == FL_GPTIM_COUNTER_DIR_DOWN) || \
                                                     ((__VALUE__) == FL_GPTIM_COUNTER_ALIGNED_EDGE) || \
                                                     ((__VALUE__) == FL_GPTIM_COUNTER_ALIGNED_CENTER_UP) || \
                                                     ((__VALUE__) == FL_GPTIM_COUNTER_ALIGNED_CENTER_DOWN) || \
                                                     ((__VALUE__) == FL_GPTIM_COUNTER_ALIGNED_CENTER_UP_DOWN))

#define IS_FL_GPTIM_CLOCKDIVISION(__VALUE__)        (((__VALUE__) == FL_GPTIM_CLK_DIVISION_DIV1) || \
                                                     ((__VALUE__) == FL_GPTIM_CLK_DIVISION_DIV2) || \
                                                     ((__VALUE__) == FL_GPTIM_CLK_DIVISION_DIV4))

#define IS_FL_GPTIM_CHANNEL_MODE(__VALUE__)         (((__VALUE__) == FL_GPTIM_CHANNEL_MODE_OUTPUT) || \
                                                     ((__VALUE__) == FL_GPTIM_CHANNEL_MODE_INPUT_NORMAL) || \
                                                     ((__VALUE__) == FL_GPTIM_CHANNEL_MODE_INPUT_CROSSOVER) || \
                                                     ((__VALUE__) == FL_GPTIM_CHANNEL_MODE_INPUT_TRC))

#define IS_FL_GPTIM_CHANNEL(__VALUE__)               (((__VALUE__) == FL_GPTIM_CHANNEL_1)\
                                                    ||((__VALUE__) == FL_GPTIM_CHANNEL_2)\
                                                    ||((__VALUE__) == FL_GPTIM_CHANNEL_3)\
                                                    ||((__VALUE__) == FL_GPTIM_CHANNEL_4))

#define IS_FL_GPTIM_SLAVE_MODE(__VALUE__)             (((__VALUE__) == FL_GPTIM_SLAVE_MODE_PROHIBITED)\
                                                    || ((__VALUE__) == FL_GPTIM_SLAVE_MODE_ENCODER_X1_TI1)\
                                                    || ((__VALUE__) == FL_GPTIM_SLAVE_MODE_ENCODER_X2_TI2)\
                                                    || ((__VALUE__) == FL_GPTIM_SLAVE_MODE_ENCODER_X4_TI1TI2)\
                                                    || ((__VALUE__) == FL_GPTIM_SLAVE_MODE_TRGI_RISE_RST)\
                                                    || ((__VALUE__) == FL_GPTIM_SLAVE_MODE_TRGI_HIGH_RUN)\
                                                    || ((__VALUE__) == FL_GPTIM_SLAVE_MODE_TRGI_RISE_RUN)\
                                                    || ((__VALUE__) == FL_GPTIM_SLAVE_MODE_TRGI_CLK)\
                                                                                                        || ((__VALUE__) == FL_GPTIM_SLAVE_MODE_TRGI_RISE_RST_RUN)\
                                                                                                        || ((__VALUE__) == FL_GPTIM_SLAVE_MODE_TRGI_HIGH_RISE_RUN)\
                                                                                                        || ((__VALUE__) == FL_GPTIM_SLAVE_MODE_TRGI_ENCODER_CLK_DIR_X2)\
                                                                                                        || ((__VALUE__) == FL_GPTIM_SLAVE_MODE_TRGI_ENCODER_CLK_DIR_X1)\
                                                                                                        || ((__VALUE__) == FL_GPTIM_SLAVE_MODE_TRGI_ENCODER_CLKWithDIR_X2)\
                                                                                                        || ((__VALUE__) == FL_GPTIM_SLAVE_MODE_TRGI_ENCODER_CLKWithDIR_X1)\
                                                                                                        || ((__VALUE__) == FL_GPTIM_SLAVE_MODE_QUADRATURE_ENCODER_X1_TI1FP1)\
                                                                                                        || ((__VALUE__) == FL_GPTIM_SLAVE_MODE_QUADRATURE_ENCODER_X1_TI2FP2))

#define IS_FL_GPTIM_TRIGGER_SRC(__VALUE__)          (((__VALUE__) ==FL_GPTIM_TRGI_ITR0 )\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_ITR1 )\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_ITR2)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_ITR3)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_TI1F_ED)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_TI1FP1)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_TI2FP2)\
                                                        ||((__VALUE__) ==FL_GPTIM_TRGI_ETRF)\
                                                                                                                ||((__VALUE__) ==FL_GPTIM_TRGI_ITR4)\
                                                                                                                ||((__VALUE__) ==FL_GPTIM_TRGI_ITR5)\
                                                                                                                ||((__VALUE__) ==FL_GPTIM_TRGI_ITR6)\
                                                                                                                ||((__VALUE__) ==FL_GPTIM_TRGI_ITR7)\
                                                                                                                ||((__VALUE__) ==FL_GPTIM_TRGI_ITR8)\
                                                                                                                ||((__VALUE__) ==FL_GPTIM_TRGI_ITR9)\
                                                                                                                ||((__VALUE__) ==FL_GPTIM_TRGI_ITR10)\
                                                                                                                ||((__VALUE__) ==FL_GPTIM_TRGI_ITR11)\
                                                                                                                ||((__VALUE__) ==FL_GPTIM_TRGI_ITR12)\
                                                                                                                ||((__VALUE__) ==FL_GPTIM_TRGI_ITR13)\
                                                                                                                ||((__VALUE__) ==FL_GPTIM_TRGI_ITR14)\
                                                                                                                ||((__VALUE__) ==FL_GPTIM_TRGI_ITR15))

