waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Src/fm33fk5xx_fl_gptim.c
#define IS_FL_GPTIM_ETR_FILTER(__VALUE__)           (((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV1) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV1_N2) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV1_N4) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV1_N8) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV2_N6) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV2_N8) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV4_N6) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV4_N8) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV8_N6) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV8_N8) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV16_N5) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV16_N6) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV16_N8) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV32_N5) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV32_N6) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_FILTER_DIV32_N8))

#define IS_FL_GPTIM_ETR_PSC(__VALUE__)              (((__VALUE__) == FL_GPTIM_ETR_PSC_DIV1) ||\
                                                     ((__VALUE__) == FL_GPTIM_ETR_PSC_DIV2) ||\
                                                     ((__VALUE__) == FL_GPTIM_ETR_PSC_DIV4) ||\
                                                     ((__VALUE__) == FL_GPTIM_ETR_PSC_DIV8))

#define IS_FL_GPTIM_ETR_POLARITY(__VALUE__)         (((__VALUE__) == FL_GPTIM_ETR_POLARITY_NORMAL) || \
                                                     ((__VALUE__) == FL_GPTIM_ETR_POLARITY_INVERT))

#define IS_FL_GPTIM_IC_POLARITY(__VALUE__)          (((__VALUE__) == FL_GPTIM_IC_POLARITY_NORMAL) \
                                                       || ((__VALUE__) == FL_GPTIM_IC_POLARITY_INVERT))

#define IS_FL_GPTIM_IC_PSC(__VALUE__)               (((__VALUE__) == FL_GPTIM_IC_PSC_DIV1) \
                                                     || ((__VALUE__) == FL_GPTIM_IC_PSC_DIV2) \
                                                     || ((__VALUE__) == FL_GPTIM_IC_PSC_DIV4) \
                                                     || ((__VALUE__) == FL_GPTIM_IC_PSC_DIV8))

#define IS_FL_GPTIM_OC_POLARITY(__VALUE__)          (((__VALUE__) == FL_GPTIM_OC_POLARITY_NORMAL) \
                                                    || ((__VALUE__) == FL_GPTIM_OC_POLARITY_INVERT))

#define IS_FL_GPTIM_OC_MODE(__VALUE__)               (((__VALUE__) ==   FL_GPTIM_OC_MODE_FROZEN) \
                                                      || ((__VALUE__) == FL_GPTIM_OC_MODE_ACTIVE) \
                                                      || ((__VALUE__) == FL_GPTIM_OC_MODE_INACTIVE) \
                                                      || ((__VALUE__) == FL_GPTIM_OC_MODE_TOGGLE) \
                                                      || ((__VALUE__) == FL_GPTIM_OC_MODE_FORCED_INACTIVE) \
                                                      || ((__VALUE__) == FL_GPTIM_OC_MODE_FORCED_ACTIVE) \
                                                      || ((__VALUE__) == FL_GPTIM_OC_MODE_PWM1) \
                                                      || ((__VALUE__) == FL_GPTIM_OC_MODE_PWM2)\
                                                                                                            || ((__VALUE__) == FL_GPTIM_OC_MODE_RETRIG_OPM1)\
                                                                                                            || ((__VALUE__) == FL_GPTIM_OC_MODE_RETRIG_OPM2)\
                                                                                                            || ((__VALUE__) == FL_GPTIM_OC_MODE_COMBIME_PWM1)\
                                                                                                            || ((__VALUE__) == FL_GPTIM_OC_MODE_COMBIME_PWM2)\
                                                                                                            || ((__VALUE__) == FL_GPTIM_OC_MODE_DISSYMMETRIC_PWM1)\
                                                                                                            || ((__VALUE__) == FL_GPTIM_OC_MODE_DISSYMMETRIC_PWM2))

#define IS_FL_GPTIM_OC_FASTMODE(__VALUE__)          (((__VALUE__) == FL_ENABLE) \
                                                    || ((__VALUE__) == FL_DISABLE))

#define IS_FL_GPTIM_OC_PRELOAD(__VALUE__)           (((__VALUE__) == FL_ENABLE) \
                                                    || ((__VALUE__) == FL_DISABLE))

#define IS_FL_GPTIM_OC_ETR_CLEARN(__VALUE__)        (((__VALUE__) == FL_ENABLE) \
                                                    || ((__VALUE__) == FL_DISABLE))

#define IS_FL_GPTIM_TRIGGER_DELAY(__VALUE__)       (((__VALUE__) == FL_DISABLE) \
                                                    || ((__VALUE__) == FL_ENABLE))

#define IS_FL_GPTIM_IC_CAPTURE_STATE(__VALUE__)    (((__VALUE__) == FL_DISABLE) \
                                                     || ((__VALUE__) == FL_ENABLE))

#define IS_FL_GPTIM_ETR_INPUT(__VALUE__)            (((__VALUE__) ==   FL_GPTIM_TIM_ETR_IN0) \
                                                     || ((__VALUE__) == FL_GPTIM_TIM_ETR_IN1) \
                                                     || ((__VALUE__) == FL_GPTIM_TIM_ETR_IN2) \
                                                     || ((__VALUE__) == FL_GPTIM_TIM_ETR_IN3) \
                                                     || ((__VALUE__) == FL_GPTIM_TIM_ETR_IN4) \
                                                     || ((__VALUE__) == FL_GPTIM_TIM_ETR_IN5) \
                                                     || ((__VALUE__) == FL_GPTIM_TIM_ETR_IN6) \
                                                     || ((__VALUE__) == FL_GPTIM_TIM_ETR_IN7)\
                                                     || ((__VALUE__) == FL_GPTIM_TIM_ETR_IN8)\
                                                     || ((__VALUE__) == FL_GPTIM_TIM_ETR_IN9)\
                                                     || ((__VALUE__) == FL_GPTIM_TIM_ETR_IN10)\
                                                     || ((__VALUE__) == FL_GPTIM_TIM_ETR_IN11)\
                                                     || ((__VALUE__) == FL_GPTIM_TIM_ETR_IN12)\
                                                     || ((__VALUE__) == FL_GPTIM_TIM_ETR_IN13)\
                                                     || ((__VALUE__) == FL_GPTIM_TIM_ETR_IN14)\
                                                     || ((__VALUE__) == FL_GPTIM_TIM_ETR_IN15))

#define IS_FL_GPTIM_TI_SELEST(__VALUE__)            (((__VALUE__) ==   FL_GPTIM_TIM_CH)\
                                                      || ((__VALUE__) == FL_GPTIM_TIM_TI_IN1)\
                                                      || ((__VALUE__) == FL_GPTIM_TIM_TI_IN2)\
                                                      || ((__VALUE__) == FL_GPTIM_TIM_TI_IN3)\
                                                      || ((__VALUE__) == FL_GPTIM_TIM_TI_IN4)\
                                                      || ((__VALUE__) == FL_GPTIM_TIM_TI_IN5)\
                                                      || ((__VALUE__) == FL_GPTIM_TIM_TI_IN6)\
                                                      || ((__VALUE__) == FL_GPTIM_TIM_TI_IN7)\
                                                      || ((__VALUE__) == FL_GPTIM_TIM_TI_IN8)\
                                                      || ((__VALUE__) == FL_GPTIM_TIM_TI_IN9)\
                                                      || ((__VALUE__) == FL_GPTIM_TIM_TI_IN10)\
                                                      || ((__VALUE__) == FL_GPTIM_TIM_TI_IN11)\
                                                      || ((__VALUE__) == FL_GPTIM_TIM_TI_IN12)\
                                                      || ((__VALUE__) == FL_GPTIM_TIM_TI_IN13)\
                                                      || ((__VALUE__) == FL_GPTIM_TIM_TI_IN14)\
                                                      || ((__VALUE__) == FL_GPTIM_TIM_TI_IN15))

/**
  * @}
  */

